Revit 2016 API
PointCloudOverrides Members
The PointCloudOverrides type exposes the following members.
Constructors
Name | Description
PointCloudOverrides
 Constructs empty overrides object.
Methods
Name | Description
ArePointCloudOverrideSettingsValid
 Checks if PointCloudOverrideSettings are valid
Assign
 Assigns values of the source overrides to this object.
Dispose
Releases all resources used by the PointCloudOverrides
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPointCloudOverrideSettings(ElementId)
 Gets override settings assigned to the whole PointCloudInstance element.
GetPointCloudOverrideSettings(ElementId, String, Document)
 Gets override settings assigned to a particular scan within a PointCloudInstance element.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if the contents of two overrides are equal.
SetPointCloudOverrideSettings(ElementId, PointCloudOverrideSettings)
 Assigns override settings to the whole PointCloudInstance element.
SetPointCloudOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document)
 Assigns override settings to a particular scan within a PointCloudInstance element.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace